# This notebook is for Basic EDA

In [1]:
import pandas as pd
import numpy as np
import os
DATA_FOLDER = '..//data//'
d_parser = lambda x: pd.datetime.strptime(x,'%d.%m.%Y')

In [2]:
df_sample_sub = pd.read_csv(os.path.join(DATA_FOLDER,'sample_submission.csv'))
df_stv        = pd.read_csv(os.path.join(DATA_FOLDER,'sales_train_validation.csv'))
df_ste        = pd.read_csv(os.path.join(DATA_FOLDER,'sales_train_evaluation.csv'))
df_prices     = pd.read_csv(os.path.join(DATA_FOLDER,'sell_prices.csv'))
df_calander   = pd.read_csv(os.path.join(DATA_FOLDER,'calendar.csv'))

### Checking the Sample Submission file

In [3]:
df_sample_sub.head()

,id,F1,F2,F3,F4,F5,F6,F7,F8,F9,...,F19,F20,F21,F22,F23,F24,F25,F26,F27,F28
0,HOBBIES_1_001_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,HOBBIES_1_002_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,HOBBIES_1_003_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,HOBBIES_1_004_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,HOBBIES_1_005_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

**Important things to be noted about the Submission file**
* The submission file is a format, which we have to follow when putting our submissions
* The total number of rows in the submission files will be (total id in validation + total id in evaluation)

In [4]:
df_stv.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1904,d_1905,d_1906,d_1907,d_1908,d_1909,d_1910,d_1911,d_1912,d_1913
0,HOBBIES_1_001_CA_1_validation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,3,0,1,1,1,3,0,1,1
1,HOBBIES_1_002_CA_1_validation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,HOBBIES_1_003_CA_1_validation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,1,2,1,1,1,0,1,1,1
3,HOBBIES_1_004_CA_1_validation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,5,4,1,0,1,3,7,2
4,HOBBIES_1_005_CA_1_validation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,1,1,0,1,1,2,2,2,4

* **It is quite clear now that the columns which start from d_ are representing days.**
* **We need to convert those days into rows, so that we should be able to process them**

### Checking for the Uniques

In [5]:
print('Evaluation Dataset: \n', df_ste.agg({'id':'nunique','item_id':'nunique', 'store_id':'nunique'}))
print('\n')
print('Validation Dataset: \n', df_stv.agg({'id':'nunique','item_id':'nunique', 'store_id':'nunique'}))

Evaluation Dataset:
 id          30490
item_id      3049
store_id       10
dtype: int64


Validation Dataset:
 id          30490
item_id      3049
store_id       10
dtype: int64

**So, the unique ID in both evaluation and validation is unique_item_id X unique_store_id**

### Converting the Days in the Evaluation and Validation Datasets 
* The column format to be converted into row format

In [6]:
df_ste_rows = df_ste.melt(
id_vars=['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'],
var_name ='d',
value_name ='target'
)

df_stv_rows = df_stv.melt(
id_vars=['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'],
var_name ='d',
value_name ='target'
)

In [7]:
df_ste_rows.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59181090 entries, 0 to 59181089
Data columns (total 8 columns):
 #   Column    Dtype
---  ------    -----
 0   id        object
 1   item_id   object
 2   dept_id   object
 3   cat_id    object
 4   store_id  object
 5   state_id  object
 6   d         object
 7   target    int64
dtypes: int64(1), object(7)
memory usage: 3.5+ GB

In [8]:
df_stv_rows.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58327370 entries, 0 to 58327369
Data columns (total 8 columns):
 #   Column    Dtype
---  ------    -----
 0   id        object
 1   item_id   object
 2   dept_id   object
 3   cat_id    object
 4   store_id  object
 5   state_id  object
 6   d         object
 7   target    int64
dtypes: int64(1), object(7)
memory usage: 3.5+ GB

In [9]:
df_ste.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30490 entries, 0 to 30489
Columns: 1947 entries, id to d_1941
dtypes: int64(1941), object(6)
memory usage: 452.9+ MB

In [10]:
df_stv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30490 entries, 0 to 30489
Columns: 1919 entries, id to d_1913
dtypes: int64(1913), object(6)
memory usage: 446.4+ MB

# down casting

In [11]:
#removing the d_ from it to make it int
#down casting
df_ste_rows['d']   = df_ste_rows['d'].apply(lambda x: x.replace('d_',''))
df_ste_rows['d']   = df_ste_rows['d'].astype('int16')

df_ste_rows.item_id  = df_ste_rows.item_id.astype('category')
df_ste_rows.id       = df_ste_rows.id.astype('category')
df_ste_rows.store_id = df_ste_rows.store_id.astype('category')
df_ste_rows.state_id = df_ste_rows.state_id.astype('category')
df_ste_rows.cat_id   = df_ste_rows.cat_id.astype('category')
df_ste_rows.dept_id  = df_ste_rows.dept_id.astype('category')
df_ste_rows.target   = df_ste_rows.target.astype('int16')


df_stv_rows['d']   = df_stv_rows['d'].apply(lambda x: x.replace('d_',''))
df_stv_rows['d']   = df_stv_rows['d'].astype('int16')

df_stv_rows.item_id  = df_stv_rows.item_id.astype('category')
df_stv_rows.id       = df_stv_rows.id.astype('category')
df_stv_rows.store_id = df_stv_rows.store_id.astype('category')
df_stv_rows.state_id = df_stv_rows.state_id.astype('category')
df_stv_rows.cat_id   = df_stv_rows.cat_id.astype('category')
df_stv_rows.dept_id  = df_stv_rows.dept_id.astype('category')
df_stv_rows.target   = df_stv_rows.target.astype('int16')

**checking for the rows after conversion**

In [12]:
len(df_ste_rows), len(df_stv_rows), len(df_ste), len(df_stv)

(59181090, 58327370, 30490, 30490)

In [13]:
df_ste_rows.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59181090 entries, 0 to 59181089
Data columns (total 8 columns):
 #   Column    Dtype
---  ------    -----
 0   id        category
 1   item_id   category
 2   dept_id   category
 3   cat_id    category
 4   store_id  category
 5   state_id  category
 6   d         int16
 7   target    int16
dtypes: category(6), int16(2)
memory usage: 678.9 MB

In [14]:
df_stv_rows.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58327370 entries, 0 to 58327369
Data columns (total 8 columns):
 #   Column    Dtype
---  ------    -----
 0   id        category
 1   item_id   category
 2   dept_id   category
 3   cat_id    category
 4   store_id  category
 5   state_id  category
 6   d         int16
 7   target    int16
dtypes: category(6), int16(2)
memory usage: 669.1 MB

### checking for the last days to ensure that it corresponds to last column in (unconverted dataframe)

In [15]:
df_ste_rows.d.max(), df_stv_rows.d.max()

(1941, 1913)

# Checking the difference between the Evaluation and Validation Sales data

In [16]:
max_d_in_e = df_ste_rows.d.max()
max_d_in_v = df_stv_rows.d.max()

d = 1449
s = df_ste_rows[(df_ste_rows.d==d) & (df_ste_rows.state_id=='CA')]['target'].sum()
t = df_stv_rows[(df_stv_rows.d==d) & (df_stv_rows.state_id=='CA')]['target'].sum()

print(s,t)
print(f'max for validation is {max_d_in_v} and max in evaluation is {max_d_in_e}')
print(f'total additional days in evaluation are {max_d_in_e - max_d_in_v}')

13997 13997
max for validation is 1913 and max in evaluation is 1941
total additional days in evaluation are 28

**This means that both data sets are same, and we have to train our model on validation dataset, and** 

### Step-1
* train our model on validation dataset which is until 1913
* predict for  1914 + 28
* evaluate the performance of our dataset from the evaluate dataset, as these dates are available.

### Step-2 (final predictions)
* train our model on evaluation dataset which is until 1941
* predict for 1942 + 28
* submit to kaggle

<font color=red> Or rather we don't use the validation data at all, and extract (last 28 days) from evaluation for test</font>

### Analyzing for Calendar

In [17]:
df_calander.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [18]:
df_ste_rows.item_id.nunique(), df_ste_rows.id.nunique(), df_ste_rows.store_id.nunique()

(3049, 30490, 10)

In [19]:
df_ste_rows.target.max(),df_ste_rows.target.min()

(763, 0)

In [20]:
total_weeks_2015 = df_calander[df_calander.year==2015]['wm_yr_wk'].sort_values().nunique()
print('We have ',df_calander[df_calander.year==2015]['wm_yr_wk'].sort_values().nunique(), ' weeks in 2015\n')
df_calander[df_calander.year==2015]['wm_yr_wk'].sort_values().unique()

We have  53  weeks in 2015

array([11448, 11449, 11450, 11451, 11452, 11501, 11502, 11503, 11504,
       11505, 11506, 11507, 11508, 11509, 11510, 11511, 11512, 11513,
       11514, 11515, 11516, 11517, 11518, 11519, 11520, 11521, 11522,
       11523, 11524, 11525, 11526, 11527, 11528, 11529, 11530, 11531,
       11532, 11533, 11534, 11535, 11536, 11537, 11538, 11539, 11540,
       11541, 11542, 11543, 11544, 11545, 11546, 11547, 11548],
      dtype=int64)

In [21]:
df_calander[(df_calander.year==2015) &
           (df_calander.wm_yr_wk==11450)]

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
1442,2015-01-10,11450,Saturday,1,1,2015,d_1443,NaN,NaN,NaN,NaN,1,0,0
1443,2015-01-11,11450,Sunday,2,1,2015,d_1444,NaN,NaN,NaN,NaN,0,1,1
1444,2015-01-12,11450,Monday,3,1,2015,d_1445,NaN,NaN,NaN,NaN,0,1,1
1445,2015-01-13,11450,Tuesday,4,1,2015,d_1446,NaN,NaN,NaN,NaN,0,1,0
1446,2015-01-14,11450,Wednesday,5,1,2015,d_1447,NaN,NaN,NaN,NaN,0,0,1
1447,2015-01-15,11450,Thursday,6,1,2015,d_1448,NaN,NaN,NaN,NaN,0,1,1
1448,2015-01-16,11450,Friday,7,1,2015,d_1449,NaN,NaN,NaN,NaN,0,0,0

In [22]:
t = df_ste_rows[(df_ste_rows.d==1443) & (df_ste_rows.state_id=='CA')]['target'].sum()
print(f'So in california state, we had {t} items sold on day 1443')

So in california state, we had 19244 items sold on day 1443

# snap

There are 3 binary variables with a prefix "snap_" plus the state name.

snapCA, snapTX, and snap_WI: A binary variable (0 or 1) indicating whether the stores of CA, TX or WI allow SNAP purchases on the examined date. 1 indicates that SNAP purchases are allowed.

For those who is not familiar with SNAP like me;
"The United States federal government provides a nutrition assistance benefit called the Supplement Nutrition Assistance Program (SNAP). SNAP provides low income families and individuals with an Electronic Benefits Transfer debit card to purchase food products. In many states, the monetary benefits are dispersed to people across 10 days of the month and on each of these days 1/10 of the people will receive the benefit on their card."
Source: https://www.fns.usda.gov/snap/supplemental-nutrition-assistance-program

**there is not point in keeping a prefix of d_ with the d column as we all know that this is a day number sequence**

In [23]:
df_calander['d'] = df_calander['d'].apply(lambda x: x.replace('d_',''))
df_calander['d'] = df_calander['d'].astype('int16')

# Join Calendar and Sales (Evaluation)

In [24]:
dfmain = df_ste_rows.merge(df_calander[['date','wm_yr_wk','wday','d','snap_CA','snap_TX','snap_WI']], on=['d'], how='left')

**Verifying the merge**

In [25]:
t = df_ste_rows[(df_ste_rows.d==1443) & (df_ste_rows.state_id=='CA')]['target'].sum()
print(f'So in california state, we had {t} items sold on day 1443')

So in california state, we had 19244 items sold on day 1443

In [27]:
dfmain[(dfmain.d==1443)][['date','d','wm_yr_wk']].drop_duplicates()

                date     d  wm_yr_wk
43966580  2015-01-10  1443     11450

In [28]:
df_calander[(df_calander.d==1443)][['date','d','wm_yr_wk']].drop_duplicates()

            date     d  wm_yr_wk
1442  2015-01-10  1443     11450

# Checking the Prices

In [29]:
df_prices.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

**so, this is basically item prices on a particular week in a particular store**
* We can easily join the item prices to the main data frame.

In [30]:
dfmain = dfmain.merge(df_prices, how='left', on=['store_id','item_id','wm_yr_wk'])

### Verifying

### Cleaning the memory and removing the unwanted datasets

In [33]:
dfmain[(dfmain.d==1443)]

,id,item_id,dept_id,cat_id,store_id,state_id,d,target,date,wm_yr_wk,wday,snap_CA,snap_TX,snap_WI,sell_price
43966580,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,1443,1,2015-01-10,11450,1,1,0,0,8.26
43966581,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,1443,1,2015-01-10,11450,1,1,0,0,3.97
43966582,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,1443,0,2015-01-10,11450,1,1,0,0,2.97
43966583,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,1443,1,2015-01-10,11450,1,1,0,0,4.64
43966584,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,1443,1,2015-01-10,11450,1,1,0,0,2.88
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
43997065,FOODS_3_823_WI_3_evaluation,FOODS_3_823,FOODS_3,FOODS,WI_3,WI,1443,1,2015-01-10,11450,1,1,0,0,2.88
43997066,FOODS_3_824_WI_3_evaluation,FOODS_3_824,FOODS_3,FOODS,WI_3,WI,1443,0,2015-01-10,11450,1,1,0,0,2.68
43997067,FOODS_3_825_WI_3_evaluation,FOODS_3_825,FOODS_3,FOODS,WI_3,WI,1443,1,2015-01-10,11450,1,1,0,0,3.98
43997068,FOODS_3_826_WI_3_evaluation,FOODS_3_826,FOODS_3,FOODS,WI_3,WI,1443,0,2015-01-10,11450,1,1,0,0,1.28
43997069,FOODS_3_827_WI_3_evaluation,FOODS_3_827,FOODS_3,FOODS,WI_3,WI,1443,0,2015-01-10,11450,1,1,0,0,1.00

In [34]:
dfmain.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 59181090 entries, 0 to 59181089
Data columns (total 15 columns):
 #   Column      Dtype
---  ------      -----
 0   id          category
 1   item_id     object
 2   dept_id     category
 3   cat_id      category
 4   store_id    object
 5   state_id    category
 6   d           int16
 7   target      int16
 8   date        object
 9   wm_yr_wk    int64
 10  wday        int64
 11  snap_CA     int64
 12  snap_TX     int64
 13  snap_WI     int64
 14  sell_price  float64
dtypes: category(4), float64(1), int16(2), int64(5), object(3)
memory usage: 4.9+ GB

In [35]:
dfmain.store_id.nunique()

10

### down casting

In [36]:
dfmain.store_id = dfmain.store_id.astype('category')
dfmain.snap_CA  = dfmain.snap_CA.astype('int8')
dfmain.snap_TX  = dfmain.snap_TX.astype('int8')
dfmain.snap_WI  = dfmain.snap_WI.astype('int8')

In [38]:
dfmain.sell_price.max(), dfmain.sell_price.min(), dfmain.sell_price.mean()

(107.32, 0.01, 4.409437877207322)

In [39]:
dfmain.sell_price = dfmain.sell_price.astype('float16')

In [40]:
dfmain.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d,target,date,wm_yr_wk,wday,snap_CA,snap_TX,snap_WI,sell_price
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,1,0,2011-01-29,11101,1,0,0,0,NaN
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,1,0,2011-01-29,11101,1,0,0,0,NaN
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,1,0,2011-01-29,11101,1,0,0,0,NaN
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,1,0,2011-01-29,11101,1,0,0,0,NaN
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,1,0,2011-01-29,11101,1,0,0,0,NaN

In [43]:
df_calander[df_calander.month==1].head(15)

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,3,NaN,NaN,NaN,NaN,0,0,0
337,2012-01-01,11149,Sunday,2,1,2012,338,NewYear,National,NaN,NaN,1,1,0
338,2012-01-02,11149,Monday,3,1,2012,339,NaN,NaN,NaN,NaN,1,0,1
339,2012-01-03,11149,Tuesday,4,1,2012,340,NaN,NaN,NaN,NaN,1,1,1
340,2012-01-04,11149,Wednesday,5,1,2012,341,NaN,NaN,NaN,NaN,1,0,0
341,2012-01-05,11149,Thursday,6,1,2012,342,NaN,NaN,NaN,NaN,1,1,1
342,2012-01-06,11149,Friday,7,1,2012,343,NaN,NaN,NaN,NaN,1,1,1
343,2012-01-07,11150,Saturday,1,1,2012,344,OrthodoxChristmas,Religious,NaN,NaN,1,1,0
344,2012-01-08,11150,Sunday,2,1,2012,345,NaN,NaN,NaN,NaN,1,0,1
345,2012-01-09,11150,Monday,3,1,2012,346,NaN,NaN,NaN,NaN,1,1,1
346,2012-01-10,11150,Tuesday,4,1,2012,347,NaN,NaN,NaN,NaN,1,0,0
347,2012-01-11,11150,Wednesday,5,1,2012,348,NaN,NaN,NaN,NaN,0,1,1
348,2012-01-12,11150,Thursday,6,1,2012,349,NaN,NaN,NaN,NaN,0,1,1